renesas/rx-driver-package/source/r_mmcif_rx/r_mmcif_rx_vx.xx/r_mmcif_rx/src/targets/rx72m/r_mmcif_dev.c
    return MMC_SUCCESS;
}


/**********************************************************************************************************************
* Outline      : Transfer data by DMAC/DTC
* Function Name: r_mmcif_dev_dmacdtc_trans
* Description  : Waits for the DMAC/DTC transfer completion.
* Arguments    : uint32_t           channel             ;   MMC Channel No.
*              : int32_t            cnt                 ;   Number of data
* Return Value : MMC_SUCCESS                            ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_dmacdtc_trans(uint32_t channel, int32_t cnt)
{
    mmc_mmchndl_t  *p_hndl = 0;
    uint32_t           time = 0;

    p_hndl = MMC_GET_HNDL(channel);

    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. */
    time = cnt * 100;

    if (time < 1000)            /* 1s */
    {
        time = 1000;
    }

    if (r_mmcif_dev_start_timer(channel, time) == MMC_ERR)
    {
        return MMC_ERR;
    } 

    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (MMC_ERR == r_mmcif_dev_check_timer(channel))
        {
            R_MMCIF_Log_Func(MMC_DEBUG_ERR_ID, (uint32_t)MMC_DEV_PORT, __LINE__);
            r_mmcif_set_err(channel, MMC_ERR_HOST_TOE);
            break;
        }
        
        /* Check error. */
        if (r_mmcif_get_intstatus(channel) == MMC_SUCCESS)
        {
            if (p_hndl->ceint2 & MMC_CEINT2_ALL_ERR)
            {
                R_MMCIF_Log_Func(MMC_DEBUG_ERR_ID, (uint32_t)MMC_DEV_PORT, __LINE__);
                r_mmcif_check_info2_err(channel);
                break;
            }
        }
        
        /* Check DMAC/DTC transfer end */
        if (MMC_SET_TRANS_STOP == gs_mmc_int_dmacdtcflg[channel])
        {
            break;
        }

        /* ---- Check the stop flag. ---- */
        if (p_hndl->stop)
        {
            p_hndl->stop = 0;
            R_MMCIF_Log_Func(MMC_DEBUG_ERR_ID, (uint32_t)MMC_DEV_PORT, __LINE__);
            p_hndl->error = MMC_ERR_STOP;   /* Set an error code forcibly. */
            break;
        }
    }

    r_mmcif_dev_end_timer(channel);

    return p_hndl->error;

}


/**********************************************************************************************************************
 * Function Name: R_MMCIF_Set_DmacDtc_Trans_Flg
 *****************************************************************************************************************/ /**
 * @brief This function sets the DMAC/DTC transfer complete flag.
 * @param[in] channel
 *             Channel number : The number of the MMCIF channel used (numbering starts at 0)
 * @param[in] flg
 *             DMAC/DTC transfer complete flag : MMC_SET_TRANS_STOP
 * @retval    MMC_SUCCESS Successful operation
 * @retval    MMC_ERR     General error (channel error)
 * @details   This function sets the DMAC/DTC transfer complete flag.\n 
 *            See Section 3.21 in application note for details.
 * @note      Both initialization processing by the R_MMCIF_Open() function and mount processing by the R_MMCIF_Mount()
 *            function are required prior to executing this function.\n 
 *            Note that the error code cannot be acquired with the R_MMCIF_Get_ErrCode() function.
 */
mmc_status_t R_MMCIF_Set_DmacDtc_Trans_Flg(uint32_t channel, mmc_enum_trans_t flg)
{
#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if ((uint32_t)(sizeof(MMC_CFG_IP_BASE) / sizeof(uint32_t)) <= channel)
    {
        return MMC_ERR;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    gs_mmc_int_dmacdtcflg[channel] = flg;

    return MMC_SUCCESS;
}


/**********************************************************************************************************************
* Outline      : Clock Control Register Init
* Function Name: r_mmcif_dev_ceclkctrl_init
* Description  : Clock Control Register Init.
* Arguments    : void
* Return Value : None
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_mmcif_dev_ceclkctrl_init(void)
{
    return (MMC_CFG_TIMEOUT_TRANS | MMC_CFG_TIMEOUT_RESBUSY | MMC_CFG_TIMEOUT_RES);
}


/**********************************************************************************************************************
* Outline      : CD Terminal layout check
* Function Name: r_mmcif_dev_cd_layout
* Description  : CD Terminal layout check.
* Arguments    : uint32_t           channel              ;   MMCIF Channel No.
* Return Value : MMCIF_SUCCESS                           ;   layout ACTIVE
*              : MMCIF_ERR                               ;   layout no ACTIVE
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
mmc_status_t r_mmcif_dev_cd_layout(uint32_t channel)
{
    mmc_status_t ret = MMC_ERR;

#if defined(MMC_CFG_CH0_INCLUDED)
    if (MMC_CH0 == channel)
    {
        if (MMC_CFG_CH0_CD_ACTIVE)
        {
            ret = MMC_SUCCESS;
        }
    }
#endif  /* #if defined(MMC_CFG_CH0_INCLUDED) */

#if defined(MMC_CFG_CH1_INCLUDED)
    if (MMC_CH1 == channel)
    {
        if (MMC_CFG_CH1_CD_ACTIVE)
        {
            ret = MMC_SUCCESS;
        }
    }
#endif  /* #if defined(MMC_CFG_CH1_INCLUDED) */

    return ret;
}


/**********************************************************************************************************************
 * Function Name: R_MMCIF_Int_Handler0
 *****************************************************************************************************************/ /**
 * @brief This function is the MMCIF interrupt handler.
 * @param[in] *vect
 *             Vector table
 * @details   This function is the interrupt handler for the MMCIF driver.\n 
 *            This function is already embedded in the system as the interrupt factor processing routine 
 *            for the MMCIF.\n 
 *            When an MMC card insertion interrupt setup callback function and a status verification interrupt callback
 *            function are registered, these callback functions will be called from this function.
 * @note      Both initialization processing by the R_MMCIF_Open() function and mount processing by the R_MMCIF_Mount()
 *            function are required prior to executing this function.\n 
 *            Note that the error code cannot be acquired with the R_MMCIF_Get_ErrCode() function.
 */
void R_MMCIF_Int_Handler0(void * vect)
{
    mmc_mmchndl_t       *p_hndl = 0;
    uint32_t                int_isr = 0;
    int32_t                 cd = 0;
    uint32_t                channel = 0;

    channel = 0;
    p_hndl = MMC_GET_HNDL(channel);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    /* Check group interrupt source register. */
    int_isr = ICU.GRPBL1.LONG;

    /* Check card detection interrupt. */
    if (int_isr & MMC_CH0_INT_CDETIO)
    {
        if (MMC_SUCCESS == r_mmcif_get_det_int(channel))
        {
            if (p_hndl->int_cd_callback)
            {
                if (p_hndl->int_det & MMC_CEDETECT_INS)
                {
                    cd = MMC_CD_INSERT; /* Insert */
                }
                else
                {
                    cd = MMC_CD_REMOVE; /* Remove */
                }
                
                (*p_hndl->int_cd_callback)(cd);
            }
        }
    }

    /* Normal operation or Error/timeout interrupt */
    if (int_isr & (MMC_CH0_INT_ACCIO | MMC_CH0_INT_ERRIO))
    {
        if (MMC_SUCCESS == r_mmcif_get_int(channel))
        {
            if (p_hndl->int_callback)
            {
                (*p_hndl->int_callback)(0);
            }
        }
    }
}


/**********************************************************************************************************************
 * Function Name: R_MMCIF_Int_Handler1
 *****************************************************************************************************************/ /**
 * @brief This function is the MMCIF interrupt handler.
 * @param[in] *vect
 *             Vector table
 * @details   This function is the interrupt handler for the MMCIF driver.\n 
 *            This function is already embedded in the system as the interrupt factor processing routine 
 *            for the MMCIF.\n 
 *            When an MMC card insertion interrupt setup callback function and a status verification interrupt callback
 *            function are registered, these callback functions will be called from this function.
 * @note      Both initialization processing by the R_MMCIF_Open() function and mount processing by the R_MMCIF_Mount()
 *            function are required prior to executing this function.\n 
 *            Note that the error code cannot be acquired with the R_MMCIF_Get_ErrCode() function.
 */
void R_MMCIF_Int_Handler1(void * vect)
{
    mmc_mmchndl_t       *p_hndl = 0;
    uint32_t                int_isr = 0;
    int32_t                 cd = 0;
    uint32_t                channel = 0;

    channel = 0;
    p_hndl = MMC_GET_HNDL(channel);

#if (BSP_CFG_PARAM_CHECKING_ENABLE)
    if (0 == p_hndl)
    {
        return;
    }
#endif /* BSP_CFG_PARAM_CHECKING_ENABLE */

    /* Check group interrupt source register. */
    int_isr = ICU.GRPBL1.LONG;

    /* Check card detection interrupt. */
    if (int_isr & MMC_CH1_INT_CDETIO)
    {
        if (MMC_SUCCESS == r_mmcif_get_det_int(channel))
        {
            if (p_hndl->int_cd_callback)
            {
                if (p_hndl->int_det & MMC_CEDETECT_INS)
                {
                    cd = MMC_CD_INSERT; /* Insert */
                }
                else
                {
                    cd = MMC_CD_REMOVE; /* Remove */
                }
                
                (*p_hndl->int_cd_callback)(cd);
            }
        }
    }

    /* Normal operation or Error/timeout interrupt */
    if (int_isr & (MMC_CH1_INT_ACCIO | MMC_CH1_INT_ERRIO))
    {
        if (MMC_SUCCESS == r_mmcif_get_int(channel))
        {
            if (p_hndl->int_callback)
            {
                (*p_hndl->int_callback)(0);
            }
        }
    }
}


/**********************************************************************************************************************
 * Function Name: R_MMCIF_1ms_Interval
 *****************************************************************************************************************/ /**
 * @brief This function increments the MMCIF driver's internal timer counter.
 * @details   The internal timer counter is incremented each time this function is called.
 * @note      The application must call this function once each millisecond. However, this is not required if the timer
 *            functionality has been replaced by the r_mmcif_dev_int_wait() and r_mmcif_dev_wait() functions in 
 *            r_mmcif_dev.c.\n 
 *            Note that the error code cannot be acquired with the R_MMCIF_Get_ErrCode() function.
 */
void R_MMCIF_1ms_Interval(void)
{
    uint32_t channel = 0;

    /* WAIT_LOOP */
    for (channel = 0; channel < MMC_TIMER_MAX_CH; channel++)
    {
        if (gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_FLG] != 0)
        {
            gs_mmc_timer_cnt_out[channel][MMC_TIMER_CH_COUNT]++;
        }
    }

    return;
}


/**********************************************************************************************************************
* Outline      : MMC Start timer for timeout
* Function Name: r_mmcif_dev_start_timer
* Description  : Sets timer for checking timeout and start timer.
* Arguments    : uint32_t           channel             ;   Timer Channel No.
*              : uint32_t           msec                ;   timeout(msec order)
* Return Value : MMC_SUCCESS                            ;   Successful operation
*              : MMC_ERR                                ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
static mmc_status_t r_mmcif_dev_start_timer(uint32_t channel, uint32_t msec)
{

